Ok, this seems to _pretty much_ work @megan07:

If I start with this:
```hcl
resource "google_compute_security_policy" "test" {
  name = "test"
}
```

I get the following plan
```
  # google_compute_security_policy.test will be created
  + resource "google_compute_security_policy" "test" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "test"
      + project     = (known after apply)
      + self_link   = (known after apply)
      + type        = (known after apply)

      + advanced_options_config {
          + json_parsing = (known after apply)
          + log_level    = (known after apply)
        }
[...]
```
and it applies cleanly. Also, it still appears to be unset in the backend:
```
% gcloud compute security-policies describe test --project xyz | yq .advancedOptionsConfig                 
null
```

If I add this to the config
```hcl
  advanced_options_config {
    json_parsing = "STANDARD"
    log_level    = "VERBOSE"
  }
```

the plan looks like:
```
  # google_compute_security_policy.test will be updated in-place
  ~ resource "google_compute_security_policy" "test" {
        id          = "projects/xyz/global/securityPolicies/test"
        name        = "test"
        # (4 unchanged attributes hidden)

      + advanced_options_config {
          + json_parsing = "STANDARD"
          + log_level    = "VERBOSE"
        }

        # (1 unchanged block hidden)
    }
```

and I see this:
```
% gcloud compute security-policies describe test --project xyz | yq .advancedOptionsConfig
jsonParsing: STANDARD
logLevel: VERBOSE
```

One caveat (which I _think_ we said was expected, but just want to confirm) is that if I remove `advanced_options_config` entirely from the config, it seems to silently leave it alone vs. forcing it back to defaults. I'm not sure if we need to call that out in the commit message, release notes, or elsewhere, but I think this is probably the least annoying config that will more or less work for most use cases.

